openfoam2/OpenFOAM-2.3.x/tutorials/electromagnetics/mhdFoam/hartmann/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Set application name
application=`getApplication`

runApplication blockMesh
runApplication $application
runApplication foamCalc components U
runApplication sample

# ----------------------------------------------------------------- end-of-file
